import React from "react";
import AboutComponent from "../about-component/AboutComponent";

import pharmPhoto1 from "../../Image/bg-photo.jpg"
import pharmPhoto2 from "../../Image/bg-photo2.jpg"
import pharmPhoto3 from "../../Image/bg-photo3.jpg"
import pharmPhoto4 from "../../Image/bg-photo4.jpg"
import pharmPhoto5 from "../../Image/bg-photo5.jpg"


function AboutList(){
    const itemList = [
        {id: 1, title: 'Трохи про нас', imgurl: pharmPhoto1, description: 'Domus Serpentium це інтернет ресурс, з інформацією, що стосується аптек Івано-Франківської області. Тут зібраний список найрізноманітніших аптек, що можуть знаходитися навіть через дорогу до вашого будинку'},

        {id: 2, title: 'Аптека — храм здоров`я', imgurl: pharmPhoto3, description: 'Аптека – заклад охорони здоров`я, основним завданням якого є забезпечення населення, закладів охорони здоров`я, підприємств, установ і організацій лікарськими засобами шляхом здійснення роздрібної торгівлі.З давніх-давен фармація була складовою буття, розвитку і здоров’я людини. В усі часи благословенна фармація була місією милосердя і співчуття до ближнього. Перші аптеки в Європі з’явилися в 1100р. нашої ери в монастирях. Монахи готували лікарські засоби і безкоштовно віддавали їх хворим.'},

        {id: 3, title: 'Сучасні аптеки', imgurl: pharmPhoto2, description: 'Як і кожна річ в цьому світі, аптеки також з часом мінялися. Мінялися їхній інтер`єр, правила продажі, ліки та багато багато іншого. Проте як і в давнину, так і сьогодні без аптек та послугів, які вони надають наше життя важко було б назвати повноцінним і безпечним. Кожного дня лікарі і фармацепти дбають про наше здоров`я і життя'},
        
        {id: 4, title: 'Чому важливо ходити в аптеку', imgurl: pharmPhoto4, description: 'Ходити в атеку або лікарню варто не тільки тоді, коли недуга вже завітала в гості. Робити це варто на постійній основі. Якщо у вас з`явилися певні симптоми хвороби, не варто нехтувати цим. Варто пам`ятати, що недуга може дуже швидко прогресувати. І ви навіть це помітити не встигнете. Тому дбайте про своє здоров`я, консультуйтеся з лікарями та фармацептами'},

        {id: 5, title: 'Один клік і все знайдено', imgurl: pharmPhoto5, description: 'Тому завжди пам`ятайте про храм здров`я який знаходиться біля вас. І відвідуйте його, а наш сайт допоможе вам у цьому'}
    ];

    return(
        
        itemList.map(item => {
         return (
              <AboutComponent about={item} title = {item.title} imgurl = {item.imgurl} description = {item.description} />
         );
      })
 
     )
}
export default AboutList;